In [1]:
from pathlib import Path
import csv

csvpath = Path("C:/Users/dejay/Documents/UofT/Fintech Bootcamp/python-homework/python-homework/PyBank/budget_data.csv")

In [2]:
import pandas as pd

In [5]:
pd.read_csv("C:/Users/dejay/Documents/UofT/Fintech Bootcamp/python-homework/python-homework/PyBank/budget_data.csv")

df = pd.read_csv("C:/Users/dejay/Documents/UofT/Fintech Bootcamp/python-homework/python-homework/PyBank/budget_data.csv")

In [6]:
total = df["Profit/Losses"].sum()

total

38382578

In [23]:
total_months = df["Date"].count()

total_months

86

In [8]:
df["shifted_column"] = df["Profit/Losses"].shift(1)

df

        Date  Profit/Losses  shifted_column
0   Jan-2010         867884             NaN
1   Feb-2010         984655        867884.0
2   Mar-2010         322013        984655.0
3   Apr-2010         -69417        322013.0
4   May-2010         310503        -69417.0
..       ...            ...             ...
81  Oct-2016         102685        768450.0
82  Nov-2016         795914        102685.0
83  Dec-2016          60988        795914.0
84  Jan-2017         138230         60988.0
85  Feb-2017         671099        138230.0

[86 rows x 3 columns]

In [11]:
df["difference"] = df["Profit/Losses"] - df["shifted_column"]

df

        Date  Profit/Losses  shifted_column  difference
0   Jan-2010         867884             NaN         NaN
1   Feb-2010         984655        867884.0    116771.0
2   Mar-2010         322013        984655.0   -662642.0
3   Apr-2010         -69417        322013.0   -391430.0
4   May-2010         310503        -69417.0    379920.0
..       ...            ...             ...         ...
81  Oct-2016         102685        768450.0   -665765.0
82  Nov-2016         795914        102685.0    693229.0
83  Dec-2016          60988        795914.0   -734926.0
84  Jan-2017         138230         60988.0     77242.0
85  Feb-2017         671099        138230.0    532869.0

[86 rows x 4 columns]

In [12]:
average_difference = df["difference"].mean()

average_difference

-2315.1176470588234

In [15]:
greatest_increase = df["difference"].max()

greatest_increase

1926159.0

In [16]:
df.loc[df ["difference"] == greatest_increase]

        Date  Profit/Losses  shifted_column  difference
25  Feb-2012        1170593       -755566.0   1926159.0

In [25]:
date1 = df.loc[25, "Date"]

date1

'Feb-2012'

In [17]:
greatest_decrease = df["difference"].min()

greatest_decrease

-2196167.0

In [26]:
date2 = df.loc[44, "Date"]

date2

'Sep-2013'

In [18]:
df.loc[df ["difference"] == greatest_decrease]

        Date  Profit/Losses  shifted_column  difference
44  Sep-2013       -1196225        999942.0  -2196167.0

In [30]:
print (f"Total # Months = {total_months}")
print (f"Net Total Amount of Profit/Losses = ${total}")
print (f"Average of the Changes in Profit/Losses = ${average_difference}")
print (f"Greatest Increase in Profits = {date1} ${greatest_increase}" )
print (f"Greatest Decrease in Losses = {date2} ${greatest_decrease}")

Total # Months = 86
Net Total Amount of Profit/Losses = $38382578
Average of the Changes in Profit/Losses = $-2315.1176470588234
Greatest Increase in Profits = Feb-2012 $1926159.0
Greatest Decrease in Losses = Sep-2013 $-2196167.0